<h1><center> PPOL564 - Data Science I: Foundations <br><br><font color='grey'> 
Introduction to data in Pandas</font> </center><h1>

**In this Notebook we cover**

- Pandas data objects and how to construct them.  
- Using incides for Pandas data objects.

In [1]:
import pandas as pd
import numpy as np

# `pandas` Objects

Recall `numpy` offers a greater flexibility and efficiency when dealing with data matrices (when compared to manipulating data represented as a nested list). However, as we saw, `numpy` is limited in its capacity to deal with heterogeneous data types in a single data matrix. This is a limitation given the nature of most social science datasets. 

The `pandas` package was designed to deal with this issue. Built on top of the `numpy` library, Pandas retains and expands upon `numpy`'s functionality.

The fundamental data constructs in a `pandas` object is the `Series` and the `DataFrame`.

## `Series`

A `pandas` series is a one-dimensional labeled array capable of holding heterogeneous data types (e.g. integer, boolean, strings, etc.). The axis in a series as "index" --- similar to a list or `numpy` array--- however, we can use other data types to serve as an index, which allows for some powerful ways for manipulating the array. At it's core, a `Pandas` `Series` is nothing but a column in an excel sheet or an `R` `data.frame`.

### Constructor

To construct a pandas `Series`, we can use the `pd.Series()` constructor.

In [2]:
s = pd.Series(list("georgetown"))
s

0    g
1    e
2    o
3    r
4    g
5    e
6    t
7    o
8    w
9    n
dtype: object

### `Series` index

By default the index will be the standard 0-based integer index.

In [3]:
s.index

RangeIndex(start=0, stop=10, step=1)

In [4]:
s[1]

'e'

But we can provide a different index by feeding it any immutable data type.

In [5]:
s2 = pd.Series([i for i in range(10)],index=list("georgetown"))
s2

g    0
e    1
o    2
r    3
g    4
e    5
t    6
o    7
w    8
n    9
dtype: int64

We can now use this new index to look up values, but as we see, when the index is not unique, what results is a call to multiple positions in the series.

In [6]:
s2['g']

g    0
g    4
dtype: int64

## `DataFrame`

A `pandas` `DataFrame` is a two dimensional, relational data structure with the capacity to handle heterogeneous data types.

- "relational" = each column value contained within a row entry corresponds with the same observation. 
- "two dimensional" = a matrix data structure (no $N$-dimensional arrays). The data construct can be accessed through row/column indices. 
- "heterogeneous" = different data types can be contained within each column series. This means, for example, string, integer, and boolean values can coexist in the same data structure and retain the specific properties of their data type class. 

Put simply, a `DataFrame` is a collection of pandas series where each index position corresponds to the same observation. To be explicit, let's [peek under the hood and look at the object construction](https://goo.gl/RJrzAJ)

### Constructor

To create a pandas DataFrame, we call the `pd.DataFrame()` constructor.

#### Construction using `dict()`
As input, we need to feed in a dictionary, where the _keys_ are the column names and the values are the relational data input.

In [7]:
my_dict = {"A":[1,2,3,4,5,6],"B":[2,3,1,.3,4,1],"C":['a','b','c','d','e','f']}
pd.DataFrame(my_dict)

   A    B  C
0  1  2.0  a
1  2  3.0  b
2  3  1.0  c
3  4  0.3  d
4  5  4.0  e
5  6  1.0  f

Data must be relational. If the dimensions do not align, an error will be thrown.

In [8]:
my_dict = {"A":[1,2,3,4,5,6],"B":[2,3,1,.3,4,1],"C":['a','b','c']}
pd.DataFrame(my_dict)

ValueError: arrays must all be same length

When constructing a DataFrame from scratch, using the dict constructor can help ease typing.

In [9]:
pd.DataFrame(dict(A = [1,2,3],B = ['a','b','c']))

   A  B
0  1  a
1  2  b
2  3  c

#### Construction using `list()`

Likewise, we can simply input a list, and the `DataFrame` will put a 0-based integer index by default.

In [10]:
my_list = [4,4,5,6,7]
pd.DataFrame(my_list)

   0
0  4
1  4
2  5
3  6
4  7

The same holds if we feed in a nest list structure.

In [11]:
nested_list = np.random.randint(1,10,25).reshape(5,5).tolist()
nested_list

[[8, 3, 9, 3, 8],
 [9, 7, 3, 5, 9],
 [7, 8, 7, 6, 8],
 [2, 3, 9, 1, 4],
 [2, 4, 9, 7, 2]]

In [12]:
pd.DataFrame(nested_list)

   0  1  2  3  4
0  8  3  9  3  8
1  9  7  3  5  9
2  7  8  7  6  8
3  2  3  9  1  4
4  2  4  9  7  2

To overwrite the default indexing protocol, we can **provide a list of column names** to correspond to each column index position.

In [13]:
col_names = [f'Var{i}' for i in range(1,6)]
D = pd.DataFrame(nested_list,columns=col_names)
D

   Var1  Var2  Var3  Var4  Var5
0     8     3     9     3     8
1     9     7     3     5     9
2     7     8     7     6     8
3     2     3     9     1     4
4     2     4     9     7     2

### `DataFrame` index

Unlike with a `numpy` array, we cannot simply call a row index position.

In [15]:
D[1,:]

TypeError: '(1, slice(None, None, None))' is an invalid key

This is because the internal index to a `DataFrame` refers to the column index. This might be odd at first but if we think back to the behavior of Python dictionaries (which a DataFrame fundamentally is under the hood) we'll recall that the key is the default indexing features (as the immutable keys provide for efficient lookups in the dictionary object).

In [16]:
D['Var1']

0    8
1    9
2    7
3    2
4    2
Name: Var1, dtype: int64

Always remember that there are **2 indices** in a `DataFrame` that we must keep track of: the row `index` and the `column` index.

In [17]:
# Row index
D.index

RangeIndex(start=0, stop=5, step=1)

In [18]:
# column index
D.columns

Index(['Var1', 'Var2', 'Var3', 'Var4', 'Var5'], dtype='object')

To **access** the indices in a `DataFrame`, we need to use two build-in methods:

- `.iloc[]` = use the numerical index position to call to locations in the `DataFrame`. (_The `i` is short for `index`._)
- `.loc[]` = use the labels to call to the location in the data frame.

In [19]:
D.iloc[:3,[0,2]]

   Var1  Var3
0     8     9
1     9     3
2     7     7

In [22]:
D.loc[:3,['Var1','Var3']]

   Var1  Var3
0     8     9
1     9     3
2     7     7
3     2     9

A few things to note about `.loc[]`

- calls all named index positions. Above we get back all the requested rows (rather than the numerical range which returns one below the max value). This is because `.loc[]` treats the index as a labeled feature rather than a numerical one. 
- selecting ranges from labeled indices works the same as numerical indices. That is we can make calls to all variables in between (see below).

In [23]:
D.loc[:,'Var2':'Var4']

   Var2  Var3  Var4
0     3     9     3
1     7     3     5
2     8     7     6
3     3     9     1
4     4     9     7

As with a `series`, we can redefine the row and column indices.

In [24]:
D2 = pd.DataFrame({"A":[1,2,3,4,5,6],
                   "B":[2,3,1,.3,4,1],
                   "C":['a','b','c','d','e','f']},
                 index=["z","p","f","h","k","l"])
D2

   A    B  C
z  1  2.0  a
p  2  3.0  b
f  3  1.0  c
h  4  0.3  d
k  5  4.0  e
l  6  1.0  f

In [25]:
# We can use the named indices for look up (and as with numpy, column rearrangement).
D2.loc[["k","z","l"],["C","A"]]

   C  A
k  e  5
z  a  1
l  f  6

In [26]:
D2.loc["f":"k","B":"C"]

     B  C
f  1.0  c
h  0.3  d
k  4.0  e

### Using Indices

In [27]:
col_names = ["Country","Year","Cases","Population"]
list_dat = [["Afghanistan", 1999, 745, 19987071],
            ["Afghanistan", 2000, 2666, 20595360],
            ["Brazil", 1999,  37737,   172006362],
            ["Brazil", 2000,  80488,  174504898],
            ["China",  1999,  212258, 1272915272],
            ["China",  2000,  213766, 1280428583]]
dat = pd.DataFrame(list_dat,columns=col_names)
dat

       Country  Year   Cases  Population
0  Afghanistan  1999     745    19987071
1  Afghanistan  2000    2666    20595360
2       Brazil  1999   37737   172006362
3       Brazil  2000   80488   174504898
4        China  1999  212258  1272915272
5        China  2000  213766  1280428583

#### Setting the index as the unit of observation
We can redefine the index to work as a way to keep our unit of observation: consistent, clean, and easy to use.

In [28]:
dat = dat.set_index('Country')
dat

             Year   Cases  Population
Country
Afghanistan  1999     745    19987071
Afghanistan  2000    2666    20595360
Brazil       1999   37737   172006362
Brazil       2000   80488   174504898
China        1999  212258  1272915272
China        2000  213766  1280428583

In [29]:
dat.loc['Brazil',:]

         Year  Cases  Population
Country
Brazil   1999  37737   172006362
Brazil   2000  80488   174504898

Reverting the index back to it's original 0-based index is straight forward with the `.reset_index()` method.

In [30]:
dat = dat.reset_index()
dat

       Country  Year   Cases  Population
0  Afghanistan  1999     745    19987071
1  Afghanistan  2000    2666    20595360
2       Brazil  1999   37737   172006362
3       Brazil  2000   80488   174504898
4        China  1999  212258  1272915272
5        China  2000  213766  1280428583

#### Hierarchical (multi-) index

In [33]:
dat = dat.set_index(keys=['Country', 'Year'])
dat

                   Cases  Population
Country     Year
Afghanistan 1999     745    19987071
            2000    2666    20595360
Brazil      1999   37737   172006362
            2000   80488   174504898
China       1999  212258  1272915272
            2000  213766  1280428583

We can see that the index is composed of two levels.

In [34]:
dat.index

MultiIndex([('Afghanistan', 1999),
            ('Afghanistan', 2000),
            (     'Brazil', 1999),
            (     'Brazil', 2000),
            (      'China', 1999),
            (      'China', 2000)],
           names=['Country', 'Year'])

Under the hood, the hierarchical indices are actually tuples.

In [35]:
dat.loc[("Afghanistan",2000),:]

Cases             2666
Population    20595360
Name: (Afghanistan, 2000), dtype: int64

And like before we can call ranges of index values.

In [36]:
dat.loc[("Afghanistan",2000):("Brazil",1999),:]

                  Cases  Population
Country     Year
Afghanistan 2000   2666    20595360
Brazil      1999  37737   172006362

Or specific values

In [37]:
dat.loc[[("Afghanistan",2000),("China",1999)],:]

                   Cases  Population
Country     Year
Afghanistan 2000    2666    20595360
China       1999  212258  1272915272

To call the different index levels more explicitly, we can use the `.xs()` method, which allows one to specify a specific level to retrieve a cross-sectional view of the data. Note that one cannot reassign variable values using `.xs()`, see below.

In [38]:
dat.xs("Brazil",level="Country")

      Cases  Population
Year
1999  37737   172006362
2000  80488   174504898

In [39]:
dat.xs(1999,level="Year")

              Cases  Population
Country
Afghanistan     745    19987071
Brazil        37737   172006362
China        212258  1272915272

Also we can use boolean lookups on the level values

In [40]:
dat.loc[dat.index.get_level_values('Year') == 2000,:]

                   Cases  Population
Country     Year
Afghanistan 2000    2666    20595360
Brazil      2000   80488   174504898
China       2000  213766  1280428583

Finally, we can easily sort and order the index.

In [41]:
dat.sort_index(ascending=False)

                   Cases  Population
Country     Year
China       2000  213766  1280428583
            1999  212258  1272915272
Brazil      2000   80488   174504898
            1999   37737   172006362
Afghanistan 2000    2666    20595360
            1999     745    19987071

As before, if we wish to revert the index back to a 0-based integer, we can with `.reset_index()`

In [42]:
dat.reset_index(inplace=True)

In [43]:
dat

       Country  Year   Cases  Population
0  Afghanistan  1999     745    19987071
1  Afghanistan  2000    2666    20595360
2       Brazil  1999   37737   172006362
3       Brazil  2000   80488   174504898
4        China  1999  212258  1272915272
5        China  2000  213766  1280428583

### Column Indices ("column names")

As seen, `pandas` can keep track of column feature using column index. We can access the column index at any time using the `.columns` attribut

In [44]:
dat.columns

Index(['Country', 'Year', 'Cases', 'Population'], dtype='object')

Or we can simply redefine the dataframe using the `list()` constructor (recall the a `DataFrame` is really a `dict`)

In [45]:
list(dat)

['Country', 'Year', 'Cases', 'Population']

**Overwriting column names**: below let's set all of the columns to be lower case. Note that we can invoke a `.str` method that gives access to all of the string data type methods.

In [46]:
dat.columns = dat.columns.str.upper()
dat.columns

Index(['COUNTRY', 'YEAR', 'CASES', 'POPULATION'], dtype='object')

In [47]:
dat

       COUNTRY  YEAR   CASES  POPULATION
0  Afghanistan  1999     745    19987071
1  Afghanistan  2000    2666    20595360
2       Brazil  1999   37737   172006362
3       Brazil  2000   80488   174504898
4        China  1999  212258  1272915272
5        China  2000  213766  1280428583

But note that the **column index is _not mutable_**. Recall that _values_ are mutable in dictionary, but the _keys_ are not.

In [48]:
dat.columns[dat.columns == "POPULATION"] = "POP"

TypeError: Index does not support mutable operations

We either have to replace all the keys (as we do above), or use the `.rename()` method to rename a specific data feature by passing it a `dict` with the new renaming convention. 

```
data.rename(columns = {'old_name':'new_name'})
```

In [49]:
dat.rename(columns={"POPULATION":"POP"},
             inplace=True) # Makes the change in-place rather than making a copy
dat

       COUNTRY  YEAR   CASES         POP
0  Afghanistan  1999     745    19987071
1  Afghanistan  2000    2666    20595360
2       Brazil  1999   37737   172006362
3       Brazil  2000   80488   174504898
4        China  1999  212258  1272915272
5        China  2000  213766  1280428583

Similar to row indices, we can generate **hierarchical column indices** as well. (As we'll see this will be the default column index output when aggregating variables next time).

In [50]:
dat2 = dat.copy()

In [51]:
dat2.columns = [["A","A","B","B"],dat.columns]
dat2

             A             B
       COUNTRY  YEAR   CASES         POP
0  Afghanistan  1999     745    19987071
1  Afghanistan  2000    2666    20595360
2       Brazil  1999   37737   172006362
3       Brazil  2000   80488   174504898
4        China  1999  212258  1272915272
5        China  2000  213766  1280428583

### Stacking/Unstacking

The ease at which we can assign various index values offers a lot of flexibility regarding how we choose to shape the data. In fact, we can reshape the data in may ways by `.stack()`ing and `.unstack()`ing it.

In [52]:
dat3 = dat.set_index(["COUNTRY","YEAR"])
dat3

                   CASES         POP
COUNTRY     YEAR
Afghanistan 1999     745    19987071
            2000    2666    20595360
Brazil      1999   37737   172006362
            2000   80488   174504898
China       1999  212258  1272915272
            2000  213766  1280428583

In [53]:
dat3.unstack(level="YEAR")

              CASES                 POP
YEAR           1999    2000        1999        2000
COUNTRY
Afghanistan     745    2666    19987071    20595360
Brazil        37737   80488   172006362   174504898
China        212258  213766  1272915272  1280428583

In [54]:
d = dat3.unstack(level="COUNTRY")
d

              CASES                        POP
COUNTRY Afghanistan Brazil   China Afghanistan     Brazil       China
YEAR
1999            745  37737  212258    19987071  172006362  1272915272
2000           2666  80488  213766    20595360  174504898  1280428583

In [55]:
# Back to our original data construct
d = d.stack()
d

                   CASES         POP
YEAR COUNTRY
1999 Afghanistan     745    19987071
     Brazil        37737   172006362
     China        212258  1272915272
2000 Afghanistan    2666    20595360
     Brazil        80488   174504898
     China        213766  1280428583

If we stack the data again, we alter the unit of observation once more to be Year-Country-Variable. An Admittedly very _un_tidy data structure. The point is that `pandas` data is easy to manipulate and wield, but not every data construct is conducive to good data work.

In [56]:
d.stack()

YEAR  COUNTRY
1999  Afghanistan  CASES           745
                   POP        19987071
      Brazil       CASES         37737
                   POP       172006362
      China        CASES        212258
                   POP      1272915272
2000  Afghanistan  CASES          2666
                   POP        20595360
      Brazil       CASES         80488
                   POP       174504898
      China        CASES        213766
                   POP      1280428583
dtype: int64